# vstAddResPDMenuMode

```pascal
PROCEDURE vstAddResPDMenuMode(
				label : STRING;
				value : STRING);
```

```python
def vs.vstAddResPDMenuMode(label, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|label|STRING|   |
|value|STRING|   |

## Examples
```pascal
vstAddResPDMenuMode('Example', 'Example');
```
```python
import vs

label = 'Example text'
value = 'Example'

vs.vstAddResPDMenuMode(label, value)
```

## Version
Availability: from Vectorworks 2017

## Category
* Tool Events